axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_tim.c
    if ((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4) || (TIMx == TIM5))
    {
        /* Select the Polarity and set the CC3E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC3P));
        temp_ccen |= (uint32_t)(temp_value | (uint32_t)TIM_CC3EN);
    }
    else
    {
        /* Select the Polarity and set the CC3E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC3P | TIM_CC3NP));
        temp_ccen |= (uint32_t)(input_channel_polarity | (uint32_t)TIM_CC3EN);
    }

    /* Write to TIMx CCMOD2 and CCEN registers */
    TIMx->CCMOD2 = temp_ccmod2;
    TIMx->CCEN   = temp_ccen;
}

/**
*\*\name    Input_Channel4_Config
*\*\fun     Configure the TI4 as Inputt.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   input_channel_polarity The Input Polarity.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   input_channel_selection specifies the input to be used.
*\*\  This parameter can be one of the following values:
*\*\          - TIM_IC_SELECTION_DIRECTTI      TIM Input 4 is selected to be connected to IC4.
*\*\          - TIM_IC_SELECTION_INDIRECTTI    TIM Input 4 is selected to be connected to IC3,not for TIM3.
*\*\          - TIM_IC_SELECTION_TRC           TIM Input 4 is selected to be connected to TRC.
*\*\param   input_channel_filter Specifies the Input Capture Filter.
*\*\            [0x00 0x0F]
*\*\return  none
**/
void Input_Channel4_Config(TIM_Module* TIMx, uint16_t input_channel_polarity, 
                           uint16_t input_channel_selection, uint16_t input_channel_filter)
{
    uint16_t temp_ccmod2 = 0;
    uint32_t temp_ccen = 0, temp_value = 0;

    /* Disable the Channel 4: Reset the CC4E Bit */
    TIMx->CCEN &= (uint32_t) ~((uint32_t)TIM_CC4EN);
    temp_ccmod2 = TIMx->CCMOD2;
    temp_ccen = TIMx->CCEN;
    temp_value = (uint32_t)(input_channel_polarity << 12);
    /* Select the Input and set the filter */
    temp_ccmod2 &= (uint16_t)((uint16_t)(~(uint16_t)TIM_IC4_SELECTION_MASK) & ((uint16_t) ~((uint16_t)TIM_IC4_FILTER_MASK)));
    temp_ccmod2 |= (uint16_t)(input_channel_selection << 8);
    temp_ccmod2 |= (uint16_t)(input_channel_filter << 12);

    if ((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4) || (TIMx == TIM5))
    {
        /* Select the Polarity and set the CC4E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC4P));
        temp_ccen |= (uint32_t)(temp_value | (uint32_t)TIM_CC4EN);
    }
    else
    {
        /* Select the Polarity and set the CC4E Bit */
        temp_ccen &= (uint32_t) ~((uint32_t)(TIM_CC4P));
        temp_ccen |= (uint32_t)(input_channel_polarity | (uint32_t)TIM_CC4EN);
    }
    /* Write to TIMx CCMOD2 and CCEN registers */
    TIMx->CCMOD2 = temp_ccmod2;
    TIMx->CCEN   = temp_ccen;
}

/**
*\*\name    TIM_External_Trigger_Filter_Set
*\*\fun     Configures the filter of TIMx External Trigger.
*\*\param   TIMx 
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM8
*\*\param   external_trigger_filter 
*\*\          - [0x0,0xF]
*\*\return  none
**/
void TIM_External_Trigger_Filter_Set(TIM_Module* TIMx,
                                     uint16_t external_trigger_filter)
{
    /* Reset the ETRPSC Bits */
    uint16_t temp_value = TIMx->SMCTRL;
    temp_value &= (uint16_t)(~((uint16_t)TIM_EXT_TRIG_FILTER_MASK));
    /* Set the Prescaler, the Filter value and the Polarity */
    temp_value |= (uint16_t)(external_trigger_filter << (uint16_t)8);
    TIMx->SMCTRL = temp_value;
}


/**
*\*\name    TIM_External_Trigger_Prescaler_Set
*\*\fun     Configures the prescaler of  External Trigger (ETR).
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM8
*\*\param   external_trigger_prescaler 
*\*\          - TIM_EXT_TRG_PSC_OFF ETRP Prescaler OFF.
*\*\          - TIM_EXT_TRG_PSC_DIV2 ETRP frequency divided by 2.
*\*\          - TIM_EXT_TRG_PSC_DIV4 ETRP frequency divided by 4.
*\*\          - TIM_EXT_TRG_PSC_DIV8 ETRP frequency divided by 8.
*\*\return  - none
**/
void TIM_External_Trigger_Prescaler_Set(TIM_Module* TIMx,
                                        uint16_t external_trigger_prescaler)
{
    /* Reset the ETRPSC Bits */
    uint16_t temp_value = TIMx->SMCTRL;
    temp_value &= (uint16_t)(~((uint16_t)TIM_EXT_TRG_PSC_MASK));
    /* Set the Prescaler, the Filter value and the Polarity */
    temp_value |= (uint16_t)(external_trigger_prescaler);
    TIMx->SMCTRL = temp_value;
}

/**
*\*\name    TIM_External_Trigger_Polarity_Set
*\*\\fun Configures the polarity of TIMx External Trigger.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM8
*\*\param   external_trigger_polarity T
*\*\          - TIM_EXT_TRIG_POLARITY_INVERTED active low or falling edge active.
*\*\          - TIM_EXT_TRIG_POLARITY_NONINVERTED active high or rising edge active.
*\*\return  none
**/
void TIM_External_Trigger_Polarity_Set(TIM_Module* TIMx,
                                       uint16_t external_trigger_polarity)
{
    if(external_trigger_polarity == TIM_EXT_TRIG_POLARITY_INVERTED)
    {
        TIMx->SMCTRL |= TIM_EXT_TRIG_POLARITY_INVERTED;
    }
    else
    {
        TIMx->SMCTRL &= (uint16_t)(~((uint16_t)TIM_EXT_TRIG_POLARITY_INVERTED));
    }
}

/**
*\*\name    TIM_Clock_Division_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   clock_division 
 *   This parameter can be one of the following value:
*\*\          - TIM_CLK_DIV1 TDTS = Tck_tim
*\*\          - TIM_CLK_DIV2 TDTS = 2*Tck_tim
*\*\          - TIM_CLK_DIV4 TDTS = 4*Tck_tim
*\*\return  none
*\*\note
*\*\          - not for TIM6
**/
void TIM_Clock_Division_Set(TIM_Module* TIMx, uint16_t clock_division)
{
    TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_CLK_DIV_MASK);
    /* Set the CKD value */
    TIMx->CTRL1 |= clock_division;
}


/**
*\*\name    TIM_Internal_Clock_Set.
*\*\fun     Configures the TIMx internal Clock
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\return  none
**/
void TIM_Internal_Clock_Set(TIM_Module* TIMx)
{
    /* Disable slave mode to clock the prescaler directly with the internal clock */
    TIMx->SMCTRL &= (uint16_t)(~((uint16_t)TIM_SLAVE_MODE_MASK));
}


/**
*\*\name    TIM_Input_Capture1_Prescaler_Set
*\*\fun     Sets the TIMx Input Capture 1 prescaler.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_input_capture_prescaler 
*\*\          - TIM_IC_PSC_DIV1    no prescaler
*\*\          - TIM_IC_PSC_DIV2    capture is done once every 2 events
*\*\          - TIM_IC_PSC_DIV4    capture is done once every 4 events
*\*\          - TIM_IC_PSC_DIV8    capture is done once every 8 events
*\*\return  none
**/
void TIM_Input_Capture1_Prescaler_Set(TIM_Module* TIMx, uint16_t TIM_input_capture_prescaler)
{
    TIMx->CCMOD1 &= (uint16_t) ~((uint16_t)TIM_IC1_PSC_MASK);
    /* Set the IC1PSC value */
    TIMx->CCMOD1 |= TIM_input_capture_prescaler;    
}

/**
*\*\name    TIM_Input_Capture2_Prescaler_Set
*\*\fun     Sets the TIMx Input Capture 2 prescaler.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_input_capture_prescaler 
*\*\          - TIM_IC_PSC_DIV1    no prescaler
*\*\          - TIM_IC_PSC_DIV2    capture is done once every 2 events
*\*\          - TIM_IC_PSC_DIV4    capture is done once every 4 events
*\*\          - TIM_IC_PSC_DIV8    capture is done once every 8 events
*\*\return  none
**/
void TIM_Input_Capture2_Prescaler_Set(TIM_Module* TIMx, uint16_t TIM_input_capture_prescaler)
{
    TIMx->CCMOD1 &= (uint16_t) ~((uint16_t)TIM_IC2_PSC_MASK);
    /* Set the IC1PSC value */
    TIMx->CCMOD1 |= (uint16_t)(TIM_input_capture_prescaler << 8);    
}

/**
*\*\name    TIM_Input_Capture3_Prescaler_Set
*\*\fun     Sets the TIMx Input Capture 3 prescaler.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_input_capture_prescaler 
*\*\          - TIM_IC_PSC_DIV1    no prescaler
*\*\          - TIM_IC_PSC_DIV2    capture is done once every 2 events
*\*\          - TIM_IC_PSC_DIV4    capture is done once every 4 events
*\*\          - TIM_IC_PSC_DIV8    capture is done once every 8 events
*\*\return  none 
**/
void TIM_Input_Capture3_Prescaler_Set(TIM_Module* TIMx, uint16_t TIM_input_capture_prescaler)
{
    TIMx->CCMOD2 &= (uint16_t) ~((uint16_t)TIM_IC3_PSC_MASK);
    /* Set the IC1PSC value */
    TIMx->CCMOD2 |= TIM_input_capture_prescaler;    
}

/**
*\*\name    TIM_Input_Capture4_Prescaler_Set
*\*\fun     Sets the TIMx Input Capture 4 prescaler.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_input_capture_prescaler 
*\*\          - TIM_IC_PSC_DIV1    no prescaler
*\*\          - TIM_IC_PSC_DIV2    capture is done once every 2 events
*\*\          - TIM_IC_PSC_DIV4    capture is done once every 4 events
*\*\          - TIM_IC_PSC_DIV8    capture is done once every 8 events
*\*\return  none 
**/
void TIM_Input_Capture4_Prescaler_Set(TIM_Module* TIMx, uint16_t TIM_input_capture_prescaler)
{
    TIMx->CCMOD2 &= (uint16_t) ~((uint16_t)TIM_IC4_PSC_MASK);
    /* Set the IC1PSC value */
    TIMx->CCMOD2 |= (TIM_input_capture_prescaler << 8);    
}

/**
*\*\name    TIM_Internal_Trig_To_Ext_Set.
*\*\fun     Configures the TIMx Internal Trigger as External Clock
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   input_trigger_source:
*\*\          - TIM_TRIG_SEL_IN_TR0    Internal Trigger 0
*\*\          - TIM_TRIG_SEL_IN_TR1    Internal Trigger 1
*\*\          - TIM_TRIG_SEL_IN_TR2    Internal Trigger 2
*\*\          - TIM_TRIG_SEL_IN_TR3    Internal Trigger 3
*\*\return  none
**/
void TIM_Internal_Trig_To_Ext_Set(TIM_Module* TIMx, uint16_t input_trigger_source)
{
    /* Select the Internal Trigger */
    TIM_Trigger_Source_Select(TIMx, input_trigger_source);

    /* Select the External clock mode1 */
    TIMx->SMCTRL |= TIM_SLAVE_MODE_EXT1;
}


/**
*\*\name    TIM_Trigger_As_External_Clock.
*\*\fun     Configures the TIMx Trigger as External Clock
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   external_clock_source
*\*\          - TIM_EXT_CLK_SRC_TI1ED    TI1 Edge Detector
*\*\          - TIM_EXT_CLK_SRC_TI1      Filtered Timer Input 1
*\*\          - TIM_EXT_CLK_SRC_TI2      Filtered Timer Input 2
*\*\param   input_channel_polarity specifies the TIx Polarity.
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   input_channel_filter 
*\*\          - [0x0 0xF]
*\*\return  none
**/
void TIM_Trigger_As_External_Clock(TIM_Module* TIMx, uint16_t external_clock_source, 
                                   uint16_t input_channel_polarity, 
                                   uint16_t input_channel_filter)
{
    /* Configure the Timer Input Clock Source */
    if (external_clock_source == TIM_EXT_CLK_SRC_TI2)
    {
        Input_Channel2_Config(TIMx, input_channel_polarity, TIM_IC_SELECTION_DIRECTTI, input_channel_filter);
    }
    else
    {
        Input_Channel1_Config(TIMx, input_channel_polarity, TIM_IC_SELECTION_DIRECTTI, input_channel_filter);
    }
    /* Select the Trigger source */
    TIM_Trigger_Source_Select(TIMx, external_clock_source);
    /* Select the External clock mode1 */
    TIMx->SMCTRL |= TIM_SLAVE_MODE_EXT1;
}

/**
*\*\name    TIM_External_Clock_Mode1_Set.
*\*\fun     Configures the External clock Mode1
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM8
*\*\param   external_trigger_prescaler
*\*\          - TIM_EXT_TRG_PSC_OFF     ETRP Prescaler OFF.
*\*\          - TIM_EXT_TRG_PSC_DIV2    ETRP frequency divided by 2.
*\*\          - TIM_EXT_TRG_PSC_DIV4    ETRP frequency divided by 4.
*\*\          - TIM_EXT_TRG_PSC_DIV8    ETRP frequency divided by 8.
 * @param external_trigger_polarity The external Trigger Polarity.
*\*\          - TIM_EXT_TRIG_POLARITY_INVERTED active low or falling edge active.
*\*\          - TIM_EXT_TRIG_POLARITY_NONINVERTED active high or rising edge active.
*\*\param   external_trigger_filter 
*\*\          - [0x0 0xF]
*\*\return  none
**/
void TIM_External_Clock_Mode1_Set(TIM_Module* TIMx, uint16_t external_trigger_prescaler,
                                         uint16_t external_trigger_polarity, 
                                         uint16_t external_trigger_filter)
{
    uint16_t temp_value = 0;

