axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_tim.c
    /*IOMBKPEN 0 meaning iom as break enable*/
    if (TIM_BDTRInitStruct->IomBreakEn)
    {
        TIM_IOM_Comp_Break(TIMx, false);
    }
    /*IOMBKPEN 1 meaning comp as break enable*/
    else
    {
        TIM_IOM_Comp_Break(TIMx, true);
    }
    
    if (TIM_BDTRInitStruct->LockUpBreakEn)
    {
        TIM_Lock_Up_Break_Enable(TIMx);
    }
    else
    {
        TIM_Lock_Up_Break_Disable(TIMx);
    }
    
    if(TIM_BDTRInitStruct->PvdBreakEn)
    {
        TIM_Pvd_Break_Enable(TIMx);
    }
    else
    {
        TIM_Pvd_Break_Disable(TIMx);
    }
}


/**
*\*\name    TIM_Break_And_Dead_Time_Struct_Initialize.
*\*\param   TIM_BDTRInitStruct:
*\*\          - refer to the definition of TIM_BDTRInitType
*\*\return  none
**/
void TIM_Break_And_Dead_Time_Struct_Initialize(TIM_BDTRInitType* TIM_BDTRInitStruct)
{
    /* Set the default configuration */
    TIM_BDTRInitStruct->OssrState       = TIM_OSSR_STATE_DISABLE;
    TIM_BDTRInitStruct->OssiState       = TIM_OSSI_STATE_DISABLE;
    TIM_BDTRInitStruct->LockLevel       = TIM_LOCK_LEVEL_OFF;
    TIM_BDTRInitStruct->DeadTime        = 0x00;
    TIM_BDTRInitStruct->Break           = TIM_BREAK_IN_DISABLE;
    TIM_BDTRInitStruct->BreakPolarity   = TIM_BREAK_POLARITY_LOW;
    TIM_BDTRInitStruct->AutomaticOutput = TIM_AUTO_OUTPUT_DISABLE;
    TIM_BDTRInitStruct->IomBreakEn      = false;
    TIM_BDTRInitStruct->LockUpBreakEn   = false;
    TIM_BDTRInitStruct->PvdBreakEn      = false;
}

/**
*\*\name    TIM_Interrupt_Enable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_IT
*\*\          - TIM_INT_UPDATE    TIM update Interrupt source
*\*\          - TIM_INT_CC1       TIM Capture Compare 1 Interrupt source
*\*\          - TIM_INT_CC2       TIM Capture Compare 2 Interrupt source
*\*\          - TIM_INT_CC3       TIM Capture Compare 3 Interrupt source
*\*\          - TIM_INT_CC4       TIM Capture Compare 4 Interrupt source
*\*\          - TIM_INT_COM       TIM Commutation Interrupt source
*\*\          - TIM_INT_TRIG      TIM Trigger Interrupt source
*\*\          - TIM_INT_BREAK     TIM Break Interrupt source
*\*\note
*\*\          - TIM6 can only generate an update interrupt.
*\*\          - TIM_INT_BREAK is used only with TIM1, TIM8.
*\*\          - TIM_INT_COM is used only with TIM1, TIM8.
*\*\          - TIM_INT_CC4 is not for TIM2.
*\*\          - TIM_INT_CC3 is not for TIM3.
*\*\return  none
**/
void TIM_Interrupt_Enable(TIM_Module* TIMx, uint16_t TIM_IT)
{
    TIMx->DINTEN |= TIM_IT;
}

/**
*\*\name    TIM_Interrupt_Disable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_IT
*\*\          - TIM_INT_UPDATE    TIM update Interrupt source
*\*\          - TIM_INT_CC1       TIM Capture Compare 1 Interrupt source
*\*\          - TIM_INT_CC2       TIM Capture Compare 2 Interrupt source
*\*\          - TIM_INT_CC3       TIM Capture Compare 3 Interrupt source
*\*\          - TIM_INT_CC4       TIM Capture Compare 4 Interrupt source
*\*\          - TIM_INT_COM       TIM Commutation Interrupt source
*\*\          - TIM_INT_TRIG      TIM Trigger Interrupt source
*\*\          - TIM_INT_BREAK     TIM Break Interrupt source
*\*\note
*\*\          - TIM6 can only generate an update interrupt.
*\*\          - TIM_INT_BREAK is used only with TIM1, TIM8.
*\*\          - TIM_INT_COM is used only with TIM1, TIM8.
*\*\          - TIM_INT_CC4 is not for TIM2.
*\*\          - TIM_INT_CC3 is not for TIM3.
*\*\return  none
**/
void TIM_Interrupt_Disable(TIM_Module* TIMx, uint16_t TIM_IT)
{
    TIMx->DINTEN &= (uint16_t)(~TIM_IT);
}



/**
*\*\name    TIM_Interrupt_Status_Get
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_IT specifies the TIM interrupt source to check.
*\*\          - TIM_INT_UPDATE    TIM update Interrupt source
*\*\          - TIM_INT_CC1       TIM Capture Compare 1 Interrupt source
*\*\          - TIM_INT_CC2       TIM Capture Compare 2 Interrupt source
*\*\          - TIM_INT_CC3       TIM Capture Compare 3 Interrupt source
*\*\          - TIM_INT_CC4       TIM Capture Compare 4 Interrupt source
*\*\          - TIM_INT_COM       TIM Commutation Interrupt source
*\*\          - TIM_INT_TRIG      TIM Trigger Interrupt source
*\*\          - TIM_INT_BREAK     TIM Break Interrupt source
*\*\note
*\*\          - TIM6 can generate only an update interrupt.
*\*\          - TIM_INT_BREAK is used only with TIM1, TIM8.
*\*\          - TIM_INT_COM is used only with TIM1, TIM8.
*\*\          - TIM_INT_CC4 is not for TIM2.
*\*\          - TIM_INT_CC3 is not for TIM3.
*\*\return
*\*\          - SET
*\*\          - RESET
**/
INTStatus TIM_Interrupt_Status_Get(TIM_Module* TIMx, uint32_t TIM_IT)
{
    uint32_t interrupt_status = 0x0, interrupt_enable = 0x0;

    interrupt_status = TIMx->STS & TIM_IT;

    interrupt_enable = TIMx->DINTEN & TIM_IT;
    if ((interrupt_status != (uint32_t)RESET) && (interrupt_enable != (uint32_t)RESET))
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
*\*\name    TIM_Interrupt_Pending_Bit_Clear
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_IT
*\*\          - TIM_FLAG_UPDATE TIM1 update Interrupt source
*\*\          - TIM_FLAG_CC1 TIM Capture Compare 1 Interrupt source
*\*\          - TIM_FLAG_CC2 TIM Capture Compare 2 Interrupt source
*\*\          - TIM_FLAG_CC3 TIM Capture Compare 3 Interrupt source
*\*\          - TIM_FLAG_CC4 TIM Capture Compare 4 Interrupt source
*\*\          - TIM_FLAG_COM TIM Commutation Interrupt source
*\*\          - TIM_FLAG_TRIG TIM Trigger Interrupt source
*\*\          - TIM_FLAG_BREAK TIM Break Interrupt source
*\*\note
*\*\          - TIM6 can have only one update flag.
*\*\          - TIM_FLAG_BREAK is used only with TIM1, TIM8.
*\*\          - TIM_FLAG_COM is used only with TIM1, TIM8.
*\*\          - TIM_FLAG_CC4 is not for TIM2.
*\*\          - TIM_FLAG_CC3 is not for TIM3.
*\*\return  none
**/
void TIM_Interrupt_Status_Clear(TIM_Module* TIMx, uint32_t TIM_IT)
{
    TIMx->STS = (uint32_t)~TIM_IT;
}


/**
*\*\name    TIM_Flag_Status_Get
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_IT
*\*\This parameter can be one of the following values:
*\*\          - TIM_FLAG_UPDATE TIM update Flag
*\*\          - TIM_FLAG_CC1 TIM Capture Compare 1 Flag
*\*\          - TIM_FLAG_CC2 TIM Capture Compare 2 Flag
*\*\          - TIM_FLAG_CC3 TIM Capture Compare 3 Flag
*\*\          - TIM_FLAG_CC4 TIM Capture Compare 4 Flag
*\*\          - TIM_FLAG_COM TIM Commutation Flag
*\*\          - TIM_FLAG_TRIG TIM Trigger Flag
*\*\          - TIM_FLAG_BREAK TIM Break Flag
*\*\          - TIM_FLAG_CC1OF TIM Capture Compare 1 overcapture Flag
*\*\          - TIM_FLAG_CC2OF TIM Capture Compare 2 overcapture Flag
*\*\          - TIM_FLAG_CC3OF TIM Capture Compare 3 overcapture Flag
*\*\          - TIM_FLAG_CC4OF TIM Capture Compare 4 overcapture Flag
*\*\          - TIM_FLAG_CC5 TIM Capture Compare 5 Flag
*\*\          - TIM_FLAG_CC6 TIM Capture Compare 6 Flag
*\*\note
*\*\          - TIM6 can have only one update flag.
*\*\          - TIM_FLAG_BREAK is used only with TIM1, TIM8.
*\*\          - TIM_FLAG_COM is used only with TIM1, TIM8.
*\*\          - TIM_FLAG_CC4 is not for TIM2.
*\*\          - TIM_FLAG_CC3 is not for TIM3.
*\*\          - TIM_FLAG_CC4OF is not for TIM2.
*\*\          - TIM_FLAG_CC3OF is not for TIM3.
*\*\return  The new state of TIM_FLAG (SET or RESET).
**/
FlagStatus TIM_Flag_Status_Get(TIM_Module* TIMx, uint32_t TIM_FLAG)
{
    if ((TIMx->STS & TIM_FLAG) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
*\*\name    TIM_Flag_Clear
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_IT
*\*\          - TIM_FLAG_UPDATE TIM update Flag
*\*\          - TIM_FLAG_CC1 TIM Capture Compare 1 Flag
*\*\          - TIM_FLAG_CC2 TIM Capture Compare 2 Flag
*\*\          - TIM_FLAG_CC3 TIM Capture Compare 3 Flag
*\*\          - TIM_FLAG_CC4 TIM Capture Compare 4 Flag
*\*\          - TIM_FLAG_COM TIM Commutation Flag
*\*\          - TIM_FLAG_TRIG TIM Trigger Flag
*\*\          - TIM_FLAG_BREAK TIM Break Flag
*\*\          - TIM_FLAG_CC1OF TIM Capture Compare 1 overcapture Flag
*\*\          - TIM_FLAG_CC2OF TIM Capture Compare 2 overcapture Flag
*\*\          - TIM_FLAG_CC3OF TIM Capture Compare 3 overcapture Flag
*\*\          - TIM_FLAG_CC4OF TIM Capture Compare 4 overcapture Flag
*\*\          - TIM_FLAG_CC5 TIM Capture Compare 5 Flag
*\*\          - TIM_FLAG_CC6 TIM Capture Compare 6 Flag
*\*\note
*\*\          - TIM6 can have only one update flag.
*\*\          - TIM_FLAG_BREAK is used only with TIM1, TIM8.
*\*\          - TIM_FLAG_COM is used only with TIM1, TIM8.
*\*\          - TIM_FLAG_CC4 is not for TIM2.
*\*\          - TIM_FLAG_CC3 is not for TIM3.
*\*\          - TIM_FLAG_CC4OF is not for TIM2.
*\*\          - TIM_FLAG_CC3OF is not for TIM3.
*\*\return  none
**/
void TIM_Flag_Clear(TIM_Module* TIMx, uint32_t TIM_FLAG)
{
    TIMx->STS = (uint32_t)~TIM_FLAG;
}


/**
*\*\name    TIM_Dma_Config
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_DMABase:
*\*\         - TIM_DMABASE_CTRL1
*\*\         - TIM_DMABASE_CTRL2
*\*\         - TIM_DMABASE_SMCTRL
*\*\         - TIM_DMABASE_DMAINTEN
*\*\         - TIM_DMABASE_STS
*\*\         - TIM_DMABASE_EVTGEN
*\*\         - TIM_DMABASE_CAPCMPMOD1
*\*\         - TIM_DMABASE_CAPCMPMOD2
*\*\         - TIM_DMABASE_CAPCMPEN
*\*\         - TIM_DMABASE_CNT
*\*\         - TIM_DMABASE_PSC
*\*\         - TIM_DMABASE_AR
*\*\         - TIM_DMABASE_REPCNT
*\*\         - TIM_DMABASE_CAPCMPDAT1
*\*\         - TIM_DMABASE_CAPCMPDAT2
*\*\         - TIM_DMABASE_CAPCMPDAT3
*\*\         - TIM_DMABASE_CAPCMPDAT4
*\*\         - TIM_DMABASE_BKDT
*\*\         - TIM_DMABASE_DMACTRL
*\*\param   TIM_DMABurstLength:
*\*\         - TIM_DMABURST_LENGTH_1TRANSFER
*\*\         - TIM_DMABURST_LENGTH_2TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_3TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_4TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_5TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_6TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_7TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_8TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_9TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_10TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_11TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_12TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_13TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_14TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_15TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_16TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_17TRANSFERS
*\*\         - TIM_DMABURST_LENGTH_18TRANSFERS
*\*\return  none
**/
void TIM_Dma_Config(TIM_Module* TIMx, uint16_t TIM_DMA_base, uint16_t TIM_DMA_burst_length)
{
    TIMx->DCTRL = TIM_DMA_base | TIM_DMA_burst_length;
}
/**
*\*\name    TIM_Dma_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_DMA_source:
*\*\          - TIM_DMA_UPDATE    TIM update Interrupt source
*\*\          - TIM_DMA_CC1       TIM Capture Compare 1 DMA source
*\*\          - TIM_DMA_CC2       TIM Capture Compare 2 DMA source
*\*\          - TIM_DMA_CC3       TIM Capture Compare 3 DMA source
*\*\          - TIM_DMA_CC4       TIM Capture Compare 4 DMA source
*\*\          - TIM_DMA_COM       TIM Commutation DMA source
*\*\          - TIM_DMA_TRIG      TIM Trigger DMA source
*\*\note
*\*\          - TIM_DMA_CC4 is not for TIM2.
*\*\          - TIM_DMA_CC3 is not for TIM3.
*\*\return  none
**/
void TIM_Dma_Enable(TIM_Module* TIMx, uint16_t TIM_DMA_source)
{
    TIMx->DINTEN |= TIM_DMA_source;
}

/**
*\*\name    TIM_Dma_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_DMA_source: 
*\*\          - TIM_DMA_UPDATE    TIM update Interrupt source
*\*\          - TIM_DMA_CC1       TIM Capture Compare 1 DMA source
*\*\          - TIM_DMA_CC2       TIM Capture Compare 2 DMA source
*\*\          - TIM_DMA_CC3       TIM Capture Compare 3 DMA source
*\*\          - TIM_DMA_CC4       TIM Capture Compare 4 DMA source
*\*\          - TIM_DMA_COM       TIM Commutation DMA source
*\*\          - TIM_DMA_TRIG      TIM Trigger DMA source
*\*\note
*\*\          - TIM_DMA_CC4 is not for TIM2.
*\*\          - TIM_DMA_CC3 is not for TIM3.
*\*\return  none
**/
void TIM_Dma_Disable(TIM_Module* TIMx, uint16_t TIM_DMA_source)
{
    TIMx->DINTEN &= (uint16_t)~TIM_DMA_source;
}

/**
*\*\name    TIM_Hall_Sensor_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\return  none
**/
void TIM_Hall_Sensor_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_TI1_SEL;
}
/**
*\*\name    TIM_Hall_Sensor_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\return  none
**/
void TIM_Hall_Sensor_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t) ~((uint32_t)TIM_TI1_SEL);
}


/**
*\*\name    TIM_Encoder_Interface_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_encoder_modes: 
*\*\          - TIM_ENCODE_MODE_TI1 Counter counts on TI1FP1 edge depending on TI2FP2 level.
*\*\          - TIM_ENCODE_MODE_TI2 Counter counts on TI2FP2 edge depending on TI1FP1 level.
*\*\          - TIM_ENCODE_MODE_TI12 Counter counts on both TI1FP1 and TI2FP2 edges depending on the level of the other input.
*\*\param   TIM_input_channel1_polarity specifies the IC1 Polarity
*\*\          - TIM_IC_POLARITY_FALLING IC Falling edge.
*\*\          - TIM_IC_POLARITY_RISING IC Rising edge.
*\*\param   TIM_input_channel2_polarity specifies the IC2 Polarity
*\*\          - TIM_IC_POLARITY_FALLING IC Falling edge.
*\*\          - TIM_IC_POLARITY_RISING IC Rising edge.
*\*\return  none
**/
void TIM_Encoder_Interface_Set(TIM_Module* TIMx,uint16_t TIM_encoder_mode,
                                uint16_t TIM_input_channel1_polarity, uint16_t TIM_input_channel2_polarity)
{
    uint16_t temp_valuel  = 0;
    uint16_t temp_value2 = 0;
    uint32_t temp_value3  = 0;

    /* Get the TIMx SMCTRL register value */
    temp_valuel = TIMx->SMCTRL;

    /* Get the TIMx CCMOD1 register value */
    temp_value2 = TIMx->CCMOD1;

    /* Get the TIMx CCEN register value */
    temp_value3 = TIMx->CCEN;

    /* Set the encoder Mode */
    temp_valuel &= (uint16_t)(~((uint16_t)TIM_SMCTRL_SMSEL));
    temp_valuel |= TIM_encoder_mode;

