axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_tim.c
    /* Select the Capture Compare 1 and the Capture Compare 2 as input */
    temp_value2 &= (uint16_t)(((uint16_t) ~((uint16_t)TIM_CCMOD1_CC1SEL)) & (uint16_t)(~((uint16_t)TIM_CCMOD1_CC2SEL)));
    temp_value2 |= TIM_CCMOD1_CC1SEL_0 | TIM_CCMOD1_CC2SEL_0;

    /* Set the TI1 and the TI2 Polarities */
    temp_value3 &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_CCEN_CC1P)) & ((uint32_t) ~((uint32_t)TIM_CCEN_CC2P)));
    temp_value3 |= (uint32_t)(TIM_input_channel1_polarity | (uint16_t)(TIM_input_channel2_polarity << (uint16_t)4));

    /* Write to TIMx SMCTRL */
    TIMx->SMCTRL = temp_valuel;
    /* Write to TIMx CCMOD1 */
    TIMx->CCMOD1 = temp_value2;
    /* Write to TIMx CCEN */
    TIMx->CCEN = temp_value3;
}

/**
*\*\name    TIM_Channel1_Filter_Config
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\param   TIM_FilterInitStruct: 
*\*\          - refer to the definition of TIM_FilterInitType
*\*\return  none
**/
void TIM_Channel1_Filter_Config(TIM_Module* TIMx, TIM_FilterInitType* TIM_FilterInitStruct)
{
    uint32_t temp_value = 0;
    
    temp_value &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_FILTER_THRESH_MASK)) & 
                             ((uint32_t) ~((uint32_t)TIM_FILTER_WSIZE_MASK)) &
                             ((uint32_t) ~((uint32_t)TIM_FILTER_PSC_MASK)));

    temp_value |= (uint32_t)(TIM_FilterInitStruct->ThreshHold << (uint32_t)(TIM_FILTER_THRESH_OFFSET) | 
                             TIM_FilterInitStruct->WindowSize << (uint32_t)(TIM_FILTER_WSIZE_OFFSET) |
                             TIM_FilterInitStruct->Prescaler);

    if ((TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4) || (TIMx == TIM5))
    {
        TIMx->C1FILT = temp_value;
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Channel2_Filter_Config
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\param   TIM_FilterInitStruct: 
*\*\          - refer to the definition of TIM_FilterInitType
*\*\return  none
**/
void TIM_Channel2_Filter_Config(TIM_Module* TIMx, TIM_FilterInitType* TIM_FilterInitStruct)
{
    uint32_t temp_value = 0;
    
    temp_value &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_FILTER_THRESH_MASK)) & 
                             ((uint32_t) ~((uint32_t)TIM_FILTER_WSIZE_MASK)) &
                             ((uint32_t) ~((uint32_t)TIM_FILTER_PSC_MASK)));

    temp_value |= (uint32_t)(TIM_FilterInitStruct->ThreshHold << (uint32_t)(TIM_FILTER_THRESH_OFFSET) | 
                             TIM_FilterInitStruct->WindowSize << (uint32_t)(TIM_FILTER_WSIZE_OFFSET) |
                             TIM_FilterInitStruct->Prescaler);

    if ((TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4) || (TIMx == TIM5))
    {
        TIMx->C2FILT = temp_value;
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Channel3_Filter_Config
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM4
*\*\          - TIM5
*\*\param   TIM_FilterInitStruct: 
*\*\          - refer to the definition of TIM_FilterInitType
*\*\return  none
**/
void TIM_Channel3_Filter_Config(TIM_Module* TIMx, TIM_FilterInitType* TIM_FilterInitStruct)
{
    uint32_t temp_value = 0;
    
    temp_value &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_FILTER_THRESH_MASK)) & 
                             ((uint32_t) ~((uint32_t)TIM_FILTER_WSIZE_MASK)) &
                             ((uint32_t) ~((uint32_t)TIM_FILTER_PSC_MASK)));

    temp_value |= (uint32_t)(TIM_FilterInitStruct->ThreshHold << (uint32_t)(TIM_FILTER_THRESH_OFFSET) | 
                             TIM_FilterInitStruct->WindowSize << (uint32_t)(TIM_FILTER_WSIZE_OFFSET) |
                             TIM_FilterInitStruct->Prescaler);

    if ((TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4) || (TIMx == TIM5))
    {
        TIMx->C3FILT = temp_value;
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Channel4_Filter_Config
*\*\param   TIMx:
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\param   TIM_FilterInitStruct: 
*\*\          - refer to the definition of TIM_FilterInitType
*\*\return  none
**/
void TIM_Channel4_Filter_Config(TIM_Module* TIMx, TIM_FilterInitType* TIM_FilterInitStruct)
{
    uint32_t temp_value = 0;
    
    temp_value &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_FILTER_THRESH_MASK)) & 
                             ((uint32_t) ~((uint32_t)TIM_FILTER_WSIZE_MASK)) &
                             ((uint32_t) ~((uint32_t)TIM_FILTER_PSC_MASK)));

    temp_value |= (uint32_t)(TIM_FilterInitStruct->ThreshHold << (uint32_t)(TIM_FILTER_THRESH_OFFSET) | 
                             TIM_FilterInitStruct->WindowSize << (uint32_t)(TIM_FILTER_WSIZE_OFFSET) |
                             TIM_FilterInitStruct->Prescaler);

    if ((TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4) || (TIMx == TIM5))
    {
        TIMx->C4FILT = temp_value;
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Break_Filter_Config
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\param   TIM_FilterInitStruct: 
*\*\          - refer to the definition of TIM_FilterInitType
*\*\return  none
**/
void TIM_Break_Filter_Config(TIM_Module* TIMx, TIM_FilterInitType* TIM_FilterInitStruct)
{
    uint32_t temp_value = 0;
    
    temp_value &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_FILTER_THRESH_MASK)) & 
                             ((uint32_t) ~((uint32_t)TIM_FILTER_WSIZE_MASK)) &
                             ((uint32_t) ~((uint32_t)TIM_FILTER_PSC_MASK)));

    temp_value |= (uint32_t)(TIM_FilterInitStruct->ThreshHold << (uint32_t)(TIM_FILTER_THRESH_OFFSET) | 
                             TIM_FilterInitStruct->WindowSize << (uint32_t)(TIM_FILTER_WSIZE_OFFSET) |
                             TIM_FilterInitStruct->Prescaler);

    if ((TIMx == TIM1) || (TIMx == TIM8))
    {
        TIMx->BRK_FILT = temp_value;
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Channel1_Filter_Enable
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel1_Filter_Enable(TIM_Module* TIMx)
{
    TIMx->C1FILT |= (uint32_t)(TIM_FILTER_ENABLE); 
}

/**
*\*\name    TIM_Channel1_Filter_Disable
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel1_Filter_Disable(TIM_Module* TIMx)
{
    TIMx->C1FILT &= (uint32_t)(~TIM_FILTER_ENABLE);
}

/**
*\*\name    TIM_Channel2_Filter_Enable
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel2_Filter_Enable(TIM_Module* TIMx)
{
    TIMx->C2FILT |= (uint32_t)(TIM_FILTER_ENABLE); 
}

/**
*\*\name    TIM_Channel2_Filter_Disable
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel2_Filter_Disable(TIM_Module* TIMx)
{
    TIMx->C2FILT &= (uint32_t)(~TIM_FILTER_ENABLE);
}

/**
*\*\name    TIM_Channel3_Filter_Enable
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel3_Filter_Enable(TIM_Module* TIMx)
{
    TIMx->C3FILT |= (uint32_t)(TIM_FILTER_ENABLE); 
}

/**
*\*\name    TIM_Channel3_Filter_Disable
*\*\param   TIMx:
*\*\          - TIM2
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel3_Filter_Disable(TIM_Module* TIMx)
{
    TIMx->C3FILT &= (uint32_t)(~TIM_FILTER_ENABLE);
}

/**
*\*\name    TIM_Channel4_Filter_Enable
*\*\param   TIMx:
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel4_Filter_Enable(TIM_Module* TIMx)
{
    TIMx->C4FILT |= (uint32_t)(TIM_FILTER_ENABLE); 
}

/**
*\*\name    TIM_Channel4_Filter_Disable
*\*\param   TIMx:
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\return  none
**/
void TIM_Channel4_Filter_Disable(TIM_Module* TIMx)
{
    TIMx->C4FILT &= (uint32_t)(~TIM_FILTER_ENABLE);
}

/**
*\*\name    TIM_Break_Filter_Config
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\return  none
**/
void TIM_Break_Filter_Enable(TIM_Module * TIMx)
{
    TIMx->BRK_FILT |= (uint32_t)(TIM_FILTER_ENABLE); 
}

/**
*\*\name    TIM_Break_Filter_Config
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\return  none
**/
void TIM_Break_Filter_Disable(TIM_Module * TIMx)
{
    TIMx->BRK_FILT &= (uint32_t)(~TIM_FILTER_ENABLE);
}

